package jun02;

//이름 만들기
/*
 * 변수명, 클래스명, 메소드명, 상수명
 * 1. 사용 가능한 문자: 영어 소문자, 대문자, 숫자, $, _
 * 		단, 숫자는 이름 첫머리에 올 수 없다.
 * 2. 클래스 이름: 위 사용 가능한 문자를 조합한다.
 * 		반드시 첫글자는 대문자이어야 한다.
 * 		한 단어 이상의 단어들의 조합일 때는 새로운 단어 첫머리 글자를 대문자로 한다. = 파스칼 표기법
 * 3. 메소드명, 변수명: 사용 가능한 문자를 조합한다.
 * 		첫글자는 소문자로 시작
 * 		두 단어의 결합은 뒤에 오는 첫글자를 대문자로 한다. = 카멜 표기법
 * 4. 상수명: 모든 단어를 대문자로 구성한다.
 * 				두 단어의 결합은 두 단어 사이에 _ 붙인다. = 스네이크 표기법
 * 5. 사용할 수 없는 이름: 예약어는 사용 불가
 * 		자바에서 프로그래밍 진행에 필요한 단어를 미리 등록사용하고 있다.
 */
class AppleKorea {

}

public class Variable02 {
	public static void main(String[] args) {
		int Num = 10;
		int POINT_NUMBER = 10;
	}

}
